In [1]:
import pandas as pd
import numpy as np

In [20]:
df = pd.read_csv('movie_scores.csv')

In [4]:
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [6]:
df.isnull().sum()

first_name          1
last_name           1
age                 1
sex                 1
pre_movie_score     2
post_movie_score    2
dtype: int64

In [11]:
df.drop(['last_name'], axis=1 , inplace=True)

KeyError: "['last_name'] not found in axis"

In [12]:
df

  first_name   age  sex  pre_movie_score  post_movie_score
0        Tom  63.0    m              8.0              10.0
1        NaN   NaN  NaN              NaN               NaN
2       Hugh  51.0    m              NaN               NaN
3      Oprah  66.0    f              6.0               8.0
4       Emma  31.0    f              7.0               9.0

In [13]:
df.drop([1], axis=0, inplace=True)

In [14]:
df

  first_name   age sex  pre_movie_score  post_movie_score
0        Tom  63.0   m              8.0              10.0
2       Hugh  51.0   m              NaN               NaN
3      Oprah  66.0   f              6.0               8.0
4       Emma  31.0   f              7.0               9.0

In [16]:
df.fillna(0,inplace=True)
df

  first_name   age sex  pre_movie_score  post_movie_score
0        Tom  63.0   m              8.0              10.0
2       Hugh  51.0   m              0.0               0.0
3      Oprah  66.0   f              6.0               8.0
4       Emma  31.0   f              7.0               9.0

In [24]:
df['pre_movie_score'].fillna(df['pre_movie_score'].mean(), inplace=True)

df

C:\Users\mhija\AppData\Local\Temp\ipykernel_4916\2138263257.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['pre_movie_score'].fillna(df['pre_movie_score'].mean(), inplace=True)

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              7.0               NaN
2       Hugh   Jackman  51.0    m              7.0               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0